rasusmilch/serial_command_extreme/reference_only/PT100_Mesh_Datalogger/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.2 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_APP_REPRODUCIBLE_BUILD=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_n8r2_8mb_ota.csv"
CONFIG_APP_WIFI_ALLOW_PASSWORD_PRINT=y
CONFIG_APP_MESH_DISABLE_ROUTER=y
CONFIG_APP_SPI_MOSI_GPIO=10
CONFIG_APP_SPI_MISO_GPIO=11
CONFIG_APP_MAX31865_CS_GPIO=7
CONFIG_APP_MAX31865_RDY_PULLUP=y
CONFIG_APP_SD_CS_GPIO=13
CONFIG_APP_SD_CARD_DETECT_GPIO=14
CONFIG_APP_I2C_SDA_GPIO=4
CONFIG_APP_I2C_SCL_GPIO=5
CONFIG_APP_RUN_STOP_GPIO_ENABLE=y
CONFIG_APP_RUN_STOP_GPIO_NUM=15
CONFIG_APP_RUN_START_GPIO_ENABLE=y
CONFIG_APP_RUN_START_GPIO_NUM=3
CONFIG_APP_UNITS_GPIO_ENABLE=y
CONFIG_APP_UNITS_GPIO_DEFAULT_PIN=9
CONFIG_APP_MAX31865_FILTER_60HZ=y
CONFIG_APP_MAX31865_CONVERSION_TABLE_PT100=y
CONFIG_APP_MAX7219_ROTATE_180=y
CONFIG_APP_LOG_PERIOD_MS_DEFAULT=5000
CONFIG_APP_FRAM_FLUSH_WATERMARK_RECORDS_DEFAULT=300
CONFIG_APP_SD_BATCH_BYTES_TARGET=4096
CONFIG_APP_START_DRAIN_MAX_MS=15000
CONFIG_APP_START_DRAIN_MAX_RECORDS_PER_PASS=128
CONFIG_APP_DRAIN_MAX_RECORDS_PER_PASS=128
CONFIG_APP_DRAIN_YIELD_EVERY_RECORDS=128
CONFIG_APP_SD_TAIL_SCAN_BYTES=4096
CONFIG_APP_EXPORT_OUTBOX_DEPTH=64
CONFIG_APP_BROKER_OUTBOX_DEPTH=64
CONFIG_COMPILER_OPTIMIZATION_NONE=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP=n
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_DEBUG_STUBS_ENABLE=y
CONFIG_ESP_TIMER_TASK_STACK_SIZE=4096
CONFIG_ESP_WIFI_FTM_ENABLE=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=64
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_HEAP_POISONING_COMPREHENSIVE=y
CONFIG_HEAP_TRACING_STANDALONE=y
CONFIG_LWIP_L2_TO_L3_COPY=y
CONFIG_LWIP_TCP_MSS=624
CONFIG_MESH_LITE_ENABLE=y
